[Lang]
Table_ServerName = ServerName
Table_Status = Status
Table_Uptime = Uptime
Table_Players = Players
Table_IP = IP
Table_Port = Port
Table_Starting_Map = Starting Map
Table_Game = Game
Table_Version = Version
Table_Lastest = Lastest
Table_appID = appID

Toolbar_Start = Start
Toolbar_Stop = Stop
Toolbar_Restart = Restart
Toolbar_Update = Update
Toolbar_Add_Edit = Add/Edit
Toolbar_ShowHide =Show/Hide Server

Menu_Start = Start
Menu_Stop = Stop
Menu_Update = Update
Menu_Restart = Restart
Menu_OpenServerDir = Open Server Dir
Menu_UpdateAndValidServer =Update And Valid Server
Menu_DeleteServer = Delete Server
Menu_AddEdit =Add/Edit
Menu_DownloadServer_Title = DownloadServer
Menu_AllServers_Hide = Hide
Menu_Title = Menu
Menu_AllServers_title = All Servers

Menu_Setting_title = Settings
Menu_Auto_Update_Settings = Auto Update Settings
Menu_AllServerStarting_Settings = All Server Starting Settings
Menu_SteamAPIURLProxy_Settings = Steam API Format | URL Proxy Settings
Menu_CheckSoftwareupdate = Check Software Update
Menu_Language = Language

Menu_Process_title = Process
Menu_KillALLsrcdsexe = Kill ALL srcds.exe
Menu_KillALLSteamCMDexe = Kill ALL steamcmd.exe


control_crash_auto_restart = Crash Auto Restart
control_srcds_auto_update = SRCDS Auto Update 
control_check_Interval = Check Interval 
control_min = minute 
control_Create_Desktop_Shortcut = Create Desktop Shortcut 
control_Enable_Port_Check = Enable Port Check
control_MaxActionLog = Max Records Line7 
control_ActionLog = Action Log
control_Enable_SoftWare_Update = Enable software automatic update
control_All_Servers = All Server
control_SendSRCDS_MSG = Send
control_command_copy = copy
control_command_clear = clear

Add_Edit_Server_Name = ServerName
Add_Edit_Server_Path = ServerPath:(srcds.exe)
Add_Edit_Server_Port = Port:
Add_Edit_Server_Map = Map:
Add_Edit_Server_Optional = Optional
Add_Edit_Server_Additional_Parametes = Additional Parametes -tickrate 128 +mapgroup mg_active ..etc ..
Add_Edit_Server_Button_Save = Save
Add_Edit_Server_Button_View = Browse
Add_Edit_Server_Button_GetIP = GetIP
Add_Edit_Server_IP_Optional = IP:(Optional)
Add_Edit_Server_Title = Add OR Edit Server
Add_Edit_Server_WorkShop = WorkShop
Add_Edit_Server_Maxplayers = Maxplayers

MSGBOX_Stop_All = Stop All?
MSGBOX_Stop_All_And_Update = Stop All And Update?
MSGBOX_not_found_steamcmd = ERROR: not found steamcmd on program steamcmd/steamcmd.exe
MSGBOX_no_server_select = no server select
MSGBOX_Please_Stop_First = Please Stop First!!

MSGBOX_delete_server = delete server!
MSGBOX_Confirm_Valid = Confirm Valid And Update This Server?
MSGBOX_New_Version_Found_Do_You_want_update_New_Version = New Version Found Do You want update ? New Version:
MSGBOX_Server_Version = Server Version :
MSGBOX_Local_Version = Local Version:
MSGBOX_Confirm_delete = Confirm Delete This Server?
MSGBOX_Kill_Process = Do you want to kill the process?
MSGBOX_Process_Name =  Process Name:
MSGBOX_Process_used =   Used!!
MSGBOX_Exit_Message = Save Process Keep Servers Running?

MSGBOX_Not_Found_Server_Name = Not Found Server Name
MSGBOX_Not_Found_srcds = Path Not Found srcds.exe!!
MSGBOX_Invalid_Port = Invalid Port!!
MSGBOX_Unknow_gamename = Unknow [Game Name And APPID] Please add gamename Use additional parameters to adjust!
MSGBOX_Use_WorkShopMap = Use additional parameters to adjust!
MSGBOX_not_found_srcds2 =  srcds.exe not found!
MSGBOX_Unknow_gamename2 = example : -game csgo

MSGBOX_Stop_Running = Stop Running, 
Menu_ServerBackUP = Server BackUP
BackUP_EnableBackUP = BackUP Enable
BackUP_Save_Path = BackUP Save:
BackUP_Task_Time = BackUP Task Time:
BackUP_TIP_Time = 3 = 3:00 AM
BackUP_Test_BackUP = Test BackUP
BackUP_Save_BackUP = Save
BackUP_BackUP_Add = Add
BackUP_BackUP_Remove = Remove
BackUP_BackUP_Brose = Browse

Menu_CrashConfigure = Crash Configure
Menu_SoftWareConfigure = Software Configure
SoftWareConfigure_TIPTag1 = It's write SYSTEM [regedit]  IF permissions are not enough, try run administrator mode
SoftWareConfigure_Automatic_login_system = Automatic login system (optional) [Program Don't to remember]
SoftWareConfigure_Automatic_login_enable = Enable
SoftWareConfigure_TIPTag3 = If your system has a password, you must set it up OR Google:Auto login Windows Server 
SoftWareConfigure_Button_Automatic_login_Help = IF you want to manually operate, please click
SoftWareConfigure_Disable_Exit_Prgram_MsgBox = Disable MsgBox When Exit program
SoftWareConfigure_Start_On_Windows_Startup = Start On Windows Startup
SoftWareConfigure_Save = Save
SoftWareConfigure_Save_MessageBox = done! It's write SYSTEM [regedit] IF permissions are not enough, try run administrator mode OR Manual
SoftWareConfigure_Automatic_login_username = UserName:
SoftWareConfigure_Automatic_login_password = PassWord:

Crash_Configure_NormalMode_Lable = Normal Mode
Crash_Configure_Enable = Enable
Crash_Configure_Crash_Check_Interval = Crash Check Interval:
Crash_Configure_TIP1 = 1000 = 1 sec
Crash_Configure_TIPFailedCount= Failed Count >=
Crash_Configure_WindowsEvent_Lable = Windows Event Mode  (WaitForSingleObject Function)
Crash_Configure_Recommended_Admin_mode = Recommended run as Administrator [srcds manager software]
Crash_Configure_PortUsedKillSRCDSProcess = if Port Used Automatic Kill Process? [srcds.exe only]
Crash_Configure_ButtonSave = Save

Crash_Last_modification_Mode = Last modification Mode (SM Plugin + Update File Mode)
MSGBOX_ServerNameExists = ServerName Exists
Crash_Last_modification_Time = Last modification >=
Crash_Sec = Sec
Crash_SteamAPIMode_Lable = Steam API Mode [Slow] Online Check Mode (Possible some server not working or wrong)
Crash_Button_Help = Help
Crash_Button_Help_Last_modification = This method can help you detect stop response ,freeze. must need install the SM plugin to be effective
Crash_Button_Help_SteamAPIMode = online check mode use api.steampowered.com/ISteamApps/GetServersAtAddress/v0001?addr=PUBLIC.IP.ADDR:PORT&format=xml this method of detection is slow API has 3-5Min Cache! support freeze,stop response..etc
Button_InstallPlugin = Install Plugin

Crash_Button_Remove_Plugin = Remove Plugin
Crash_CheckBox_Online_select = Dont't forget -Edit Server - Set PublicIP if Blank is Default IP[Click Save First , will add options in server property]
Add_Edit_Server_CPU_Core_Bind_CheckBox = CPU Core Bind
Add_Edit_Server_CPU_Core_Bind_Lable = CPU Affinity (Optional)
Add_Edit_Server_TaskList_Button_DeleteTask = Delete Task
Add_Edit_Server_TaskList_Button_AddTask = Add Task

Add_Edit_Server_tabs_ServerSetting = Server Setting
Add_Edit_Server_tabs_TaskListManager = Task List Manager

Add_Edit_Server_TaskList_TAG_delete_xtasktoall = You can delete xTask.xnetdb file to delete all
Add_Edit_Server_TaskList_AddTask_Lable = Add Task
Add_Edit_Server_TaskList_AddTask_TAG_Type = Type
Add_Edit_Server_TaskList_AddTask_TAG_Action = Action
Add_Edit_Server_TaskList_AddTask_TAG_H = H
Add_Edit_Server_TaskList_AddTask_TAG_M = M
Add_Edit_Server_TaskList_AddTask_TAG_WEEK = Week
Add_Edit_Server_TaskList_AddTask_TAG_Day = Day
Add_Edit_Server_TaskList_Tables_Server = Server
Add_Edit_Server_TaskList_Tables_D_H_M = Day-Hour-Min
Add_Edit_Server_CPU_SaveTIP = CPU Affinity Failed Must Set 1 Core! back to default
Add_Edit_Server_TAG_TIP_upower = Suggest:upower plan set to High Performance 

Add_Edit_Server_TAG_TIP_CrashCheckPublicIP = (custom ip for a2s check)
Add_Edit_Server_TAG_TIP_LocalJoin = Local Join? Try 0.0.0.0 or Blank
Add_Edit_Server_TAG_TIP_PublicIP = IP(A2S)
Add_Edit_Server_CPU_Priority = Priority

Menu_ICO_DisPlay = Display
Menu_ICO_Exit = Exit
Enable_Tray_When_maximize = Enable Tray icon When maximize
Parametes_Lists_Doubleclicktouse = Double click to use
Parametes_Lists_Parametes = Parametes
Parametes_Lists_MoreParametes = MoreParametes
Parametes_Lists_Add = Add
Parametes_Lists_Edit = Edit
Parametes_Lists_Remove = Remove
Parametes_Lists_USE = USE
Parametes_Lists_Close = Close
Parametes_Lists_Note = Note
Parametes_Lists_DefaultParametes = Set As Default Parametes
Parametes_Save_ParametesList_file = [Save To (ParametesList.xnetdb) file]


FileConfig_STitle_ConfigureFile = Configure FileName Format ..Automatically deletes old backup files
FileConfig_STitle_DefaultFileName = IP+Port+User (One ZIP file an server) if same file name overlay old file
FileConfig_BackFile_AddTime = +Time
FileConfig_sTimeFileNameEg = eg:192_168_1_1_27015_username_2017_01_01_03_01.zip       No overlay of files
FileConfig_BackFile_AutoClear = Backup File Automatic Cleaner
FileConfig_FileLast_modification = Last modification >=
FileConfig_sMaxBackUPSameTime = Max Backup as same time
FileConfig_sDay = Days


Action_Log_TimeFormat_ymd = yyyy/M/d 
Action_Log_TimeFormat_hms = HH:mm:ss
Action_Log_3 = [Icon] Init Tray Icon
Action_Log_4 = [Language] Load->
Action_Log_5 = [TaskLists] Loading task scheduler count ->
Action_Log_6 = [SRCDS] Starting Server -> 
Action_Log_7 = [SRCDS] Starting Error CreateProcessA PID:->
Action_Log_8 = [Crash] [Engine Error UnKnow] ->
Action_Log_9 = [Crash] [Weapon Script Not Found for example CS:GO Map Has Cstrike Source Weapon] ->
Action_Log_10 = [Crash] SRCDS Process Exception ->

Action_Log_11 = Count:
Action_Log_12 = [Crash] SRCDS Process auto-kill [Port has been used] ->
Action_Log_13 = [Crash] Crash By Close ->
Action_Log_14 = [SoftWare] Update Server Status Running->
Action_Log_15 = [SoftWare] Update Server Pid->
Action_Log_16 = [SRCDS] Stop Server ->
Action_Log_17 = [Error] Can't close srcds possible no access Try Running Administrator Mode ->
Action_Log_18 = [SRCDS Update] can't update ->
Action_Log_19 = ->unknown This Server APPID!! Please Edit Server-configure appID
Action_Log_20 = [Error Update]->


Action_Log_21 = ->Can't Close process possible no access Try Running Administrator Mode
Action_Log_22 = [SteamCMD Update] Update Server Fnished ->
Action_Log_23 = [SteamCMD Update]--Update Server Stuck Restart...uptime >=
Action_Log_24 = [SoftWare] STOP SRCDS Version Online check...
Action_Log_25 = [Error] Software Update Failed! xnet_srcds_up.exe Not Found!!, Please Download Module :http://forums.alliedmods.net/showthread.php?t=298085
Action_Log_26 = [SoftWare] Check SoftWare Version:
Action_Log_27 = [SteamCMD Update] -> Main:
Action_Log_28 = -> ForkServer:
Action_Log_29 = -> Auto Close:
Action_Log_30 = [Backup] ERROR--BackUp End->



Action_Log_31 = ->folder Not Found!!
Action_Log_32 = [Task] ALL Servers Action:
Action_Log_33 = [SteamCMD Update] Update Server->
Action_Log_34 = [SoftWare] Updateing->
Action_Log_35 = [SoftWare] Loading SteamAPI Proxy Config
Action_Log_36 = [SoftWare] Proxy>>>
Action_Log_37 = [BackUP] Server BackUP Enable
Action_Log_38 = [Crash Check] Mode = Last modification Mode Set Timeout:
Action_Log_39 = [SoftWare] Start On Windows Startup Enable >> ALL Servers Starting...
Action_Log_40 = [SoftWare] Loading SteamAPI Format:[JSON]


Action_Log_41 = [SoftWare] Loading SteamAPI Format:[XML]
Action_Log_42 = [SoftWare] Action Log Line > 
Action_Log_43 = [SoftWare] Save To > 
Action_Log_44 = Staring BackUP Task..
Action_Log_45 = [BackUP] BackUp Server Start ->
Action_Log_46 = [CrashCheck] PID ->
Action_Log_47 =  Windows Mode->Error Monitor Try right-click administrator mode! or change crash test method type
Action_Log_48 = [Crash Check:Error] Steam API Mode Error JSON != response/success  Crash Check Not Working!! Please Change Crash Check Method!!（if not often pass through）->
Action_Log_49 = [Crash Check:Steam API Mode] Crash By Close --] ->
Action_Log_50 = Reason:[API Not Found Your Server IP] Public IP:


Action_Log_51 = [Task] Error Not Can't Find Server:
Action_Log_52 = [Task] Restart Server->
Action_Log_53 = [Task] Start Server->
Action_Log_54 = [Task] Stop Server->
Action_Log_55 = [Task] Update Server->
Action_Log_56 = [Task] BackUP Server->
Action_Log_57 = [Crash]- File Timed Last modification Timed Out!! > [
Action_Log_58 = [Crash] Check Last modification Mode-- File Not Found -- Please check plugin install sucessful..
Action_Log_59 = [BackUP] DELETE BackUP old File:
Action_Log_60 = [A2S Check] Server A2S Check Port RecvFrom Bind To:


Action_Log_61 = suggest use firewall block any remote address from accessing this port
Action_Log_62 = [A2S Check] UDP WSASendTo Intval:
Action_Log_63 = [A2S Check] Fail Count >=
Action_Log_64 = Will Restart!
Action_Log_65 = [A2S Check] Start Check Uptime >= 
Action_Log_66 = [A2S Error] Bind UDP RecvPort:
Action_Log_67 = lease Change Port! A2S Ping Check Not Working...!
Action_Log_68 = [A2S Check] SRCDS Restart ->
Action_Log_69 = Faild Count >= 
Action_Log_70 = File Listen Enable
A2S_Data_PlayerCURMax = Player Status:
